### Ordinal Number Encoding

In [1]:
import datetime

In [2]:
today_date = datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2021, 7, 6, 10, 22, 31, 635427)

In [4]:
today_date-datetime.timedelta(1) #timedelta are used to reduce the day from present day(todaydate)

datetime.datetime(2021, 7, 5, 10, 22, 31, 635427)

In [6]:
#### List Comprehension
days = [today_date-datetime.timedelta(x) for x in range(0,15)]

In [7]:
days

[datetime.datetime(2021, 7, 6, 10, 22, 31, 635427),
 datetime.datetime(2021, 7, 5, 10, 22, 31, 635427),
 datetime.datetime(2021, 7, 4, 10, 22, 31, 635427),
 datetime.datetime(2021, 7, 3, 10, 22, 31, 635427),
 datetime.datetime(2021, 7, 2, 10, 22, 31, 635427),
 datetime.datetime(2021, 7, 1, 10, 22, 31, 635427),
 datetime.datetime(2021, 6, 30, 10, 22, 31, 635427),
 datetime.datetime(2021, 6, 29, 10, 22, 31, 635427),
 datetime.datetime(2021, 6, 28, 10, 22, 31, 635427),
 datetime.datetime(2021, 6, 27, 10, 22, 31, 635427),
 datetime.datetime(2021, 6, 26, 10, 22, 31, 635427),
 datetime.datetime(2021, 6, 25, 10, 22, 31, 635427),
 datetime.datetime(2021, 6, 24, 10, 22, 31, 635427),
 datetime.datetime(2021, 6, 23, 10, 22, 31, 635427),
 datetime.datetime(2021, 6, 22, 10, 22, 31, 635427)]

In [9]:
import pandas as pd
data = pd.DataFrame(days)
data.columns=['Day']

In [10]:
data.head()

                         Day
0 2021-07-06 10:22:31.635427
1 2021-07-05 10:22:31.635427
2 2021-07-04 10:22:31.635427
3 2021-07-03 10:22:31.635427
4 2021-07-02 10:22:31.635427

In [11]:
data['weekday'] = data['Day'].dt.weekday_name
data.head()

                         Day   weekday
0 2021-07-06 10:22:31.635427   Tuesday
1 2021-07-05 10:22:31.635427    Monday
2 2021-07-04 10:22:31.635427    Sunday
3 2021-07-03 10:22:31.635427  Saturday
4 2021-07-02 10:22:31.635427    Friday

In [12]:
dictionary = {
    'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7
}

In [13]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [15]:
data['weekday_ordinal']=data['weekday'].map(dictionary)

In [16]:
data

                          Day    weekday  weekday_ordinal
0  2021-07-06 10:22:31.635427    Tuesday                2
1  2021-07-05 10:22:31.635427     Monday                1
2  2021-07-04 10:22:31.635427     Sunday                7
3  2021-07-03 10:22:31.635427   Saturday                6
4  2021-07-02 10:22:31.635427     Friday                5
5  2021-07-01 10:22:31.635427   Thursday                4
6  2021-06-30 10:22:31.635427  Wednesday                3
7  2021-06-29 10:22:31.635427    Tuesday                2
8  2021-06-28 10:22:31.635427     Monday                1
9  2021-06-27 10:22:31.635427     Sunday                7
10 2021-06-26 10:22:31.635427   Saturday                6
11 2021-06-25 10:22:31.635427     Friday                5
12 2021-06-24 10:22:31.635427   Thursday                4
13 2021-06-23 10:22:31.635427  Wednesday                3
14 2021-06-22 10:22:31.635427    Tuesday                2

### Count or Frequency Encoding

In [63]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None, index_col =None)

In [64]:
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [65]:
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [66]:
columns = [1,3,5,6,7,8,9,13]

In [67]:
train_set = train_set[columns]

In [68]:
# I will take many own column names

train_set.columns = ['Employment','Degree','Status','Designation','Family_job','Race','Sex','Country']

In [69]:
train_set.head()

,Employment,Degree,Status,Designation,Family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [70]:
for feature in train_set:
    print(feature, ":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
Family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [71]:
train_set['Country'].value_counts() #If you want covert this into dictionary

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 France                           29
 Greece                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Cambodia                         19
 Trinadad&Tobago                  19
 Thailand                         18
 Laos                             18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Hungary                          13
 Honduras                         13
 Scotland                         12
 Holand-Netherlands                1
Name: Country, dtype: int64

In [72]:
## If you to want convert above code into dictionary

country_map=train_set['Country'].value_counts().to_dict()

In [73]:
country_map

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' France': 29,
 ' Greece': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Cambodia': 19,
 ' Trinadad&Tobago': 19,
 ' Thailand': 18,
 ' Laos': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Hungary': 13,
 ' Honduras': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [74]:
train_set['Country'] = train_set['Country'].map(country_map)

In [75]:
train_set.head(20)

,Employment,Degree,Status,Designation,Family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

In [76]:
degree_map=train_set['Degree'].value_counts()

In [77]:
degree_map

 HS-grad         10501
 Some-college     7291
 Bachelors        5355
 Masters          1723
 Assoc-voc        1382
 11th             1175
 Assoc-acdm       1067
 10th              933
 7th-8th           646
 Prof-school       576
 9th               514
 12th              433
 Doctorate         413
 5th-6th           333
 1st-4th           168
 Preschool          51
Name: Degree, dtype: int64

In [78]:
train_set['Degree'] = train_set['Degree'].map(degree_map)

In [80]:
train_set.head(10)

,Employment,Degree,Status,Designation,Family_job,Race,Sex,Country
0,State-gov,5355,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,5355,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,10501,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,1175,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,5355,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,1723,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,514,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,10501,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,1723,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,5355,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170

#### Advantages

1. Easy to use
2. Not increasing future space

#### Dis-Advantages

1.It will provide same weight if the frequencies are same(It cannot handle if the frequencies are same)

### Target Guided Ordinal Encoding

1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [81]:
import pandas as pd
df = pd.read_csv('titanic_train.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [82]:
df['Cabin'].fillna('Missing',inplace=True)

In [83]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [84]:
# Here we will take the first letter from cabin column for that we use typestring(astype)
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [85]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [86]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [89]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [91]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [92]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [93]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [94]:
ordinal_labels2 = {k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [101]:
df['Cabin_ordinal_labels'] = df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

### Mean Encoding

In [105]:
mean_ordinal = df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [106]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [107]:
df['mean_ordinal_encode'] = df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854